Tekla.Structures.ModelInternal.Operation.DotSharingLogTypeEnum
Sharing operations.

Tekla.Structures.ModelInternal.Operation.DotSharingLogTypeEnum.BASIC
Basic information (always added to log).

Tekla.Structures.ModelInternal.Operation.DotSharingLogTypeEnum.INFORMATION
Optional information (added to log depending on user settings).

Tekla.Structures.ModelInternal.Operation.DotSharingLogTypeEnum.WARNING
Warning (added to log depending on user settings).

Tekla.Structures.ModelInternal.Operation.DotSharingLogTypeEnum.ERROR
Error (always added to log).